In [17]:
from holistics import HolisticsAPI
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import pandas as pd
obj = HolisticsAPI(api_key='uUyLnuhIQE0P8GbrRPx27+g92OhfZppRmdNcXv28SrI=', url='https://secure.holistics.io')

In [31]:
user_hotel_city_country = obj.export_data(report_id='68655')
top_users = obj.export_data(report_id='68657')
sample_user = obj.export_data(report_id='68660')
user_city_travelled = obj.export_data(report_id='68660')

Submitting export request... Success
Getting export results... Success
Downloading results... Export to file successed!
Submitting export request... Success
Getting export results... Success
Downloading results... Export to file successed!
Submitting export request... Success
Getting export results... Success
Downloading results... Export to file successed!
Submitting export request... Success
Getting export results... Success
Downloading results... Export to file successed!

In [19]:
user_hotel_city_country.head()

   user_id Hotel_country        Hotel_city
0  1708911      Thailand           Bangkok
1   835299      Malaysia            Penang
2      574      Thailand           Bangkok
3   214557      Thailand           Bangkok
4      574       Vietnam  Ho Chi Minh City

In [20]:
top_users.head()

   user_id  user_count
0     3762         236
1      278         207
2       98         195
3      405         194
4   333451         189

In [24]:
sample_user.head()

   user_id              city    country
0     3762      Kuala Lumpur   Malaysia
1     3762  Hong Kong Island  Hong Kong
2     3762           Bangkok   Thailand
3     3762         Singapore  Singapore
4     3762           Bangkok   Thailand

In [25]:
sample_user.city.unique()

array(['Kuala Lumpur', 'Hong Kong Island', 'Bangkok', 'Singapore',
       'Petaling Jaya', 'Koh Chang', 'Kowloon', 'Tokyo', 'Jakarta',
       'Chiang Mai', 'Bintan Island', 'Malacca', 'Phang Nga', 'Bali',
       'Krabi', 'Siem Reap', 'Chiang Rai', 'Damansara', 'Lombok',
       'Bali (Ubud)'], dtype=object)

In [30]:
for row in user_hotel_city_country:

1
1
1

In [34]:
user_city_travelled.head(20)

    user_id                                        city_string
0        40                                          Singapore
1         1                                            Kowloon
2   2034688                                            Bangkok
3   1003073                                         Yogyakarta
4    501979                     Yogyakarta,Yogyakarta,Magelang
5    598229  Bandung,Jakarta,Bogor,Cikarang Barat,Bekasi,Ja...
6    430798                                          Singapore
7    498631  Yogyakarta,Jakarta,Batam,Batam,Magelang,Bali,B...
8    485897                                          Solo,Solo
9    447339                            Jakarta,Jakarta,Jakarta
10   513366                                           Surabaya
11   156400  Bangkok,Bangkok,Bangkok,Phuket,Bali,Bangkok,Ba...
12   835299                                      Penang,Penang
13   316872                                    Bangkok,Bangkok
14   645037                                             Danang
15   494400                                    Bangkok,Bangkok
16   224387                                             Malang
17   415130                                           Surabaya
18   418687                                       Kuala Lumpur
19   599815                                          Ayutthaya